In [1]:
import pandas as pd

## 예제 3-9 특정 열에 대한 정보를 가져오기

In [2]:
flight_route_info = pd.read_csv('../data/flight_route_info.csv',encoding='cp949')

In [3]:
flight_route_info.columns

Index(['노선명', '항공사', '출발지', '출발국', '도착지', '도착국', '검수', '2016.6', '2018.5',
       '상태', '비고', '운항 횟수', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_겨울 총합', '운항_2017.3', '운항_2017.4',
       '운항_2017.5', '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄',
       '운항_2018봄', '운항_봄 총합', '운항_2016.6', '운항_2016.7', '운항_2016.8',
       '운항_2017.6', '운항_2017.7', '운항_2017.8', '운항_2016여름', '운항_2017여름',
       '운항_여름 총합', '운항_2016.9', '운항_2016.10', '운항_2016.11', '운항_2017.9',
       '운항_2017.10', '운항_2017.11', '운항_2016가을', '운항_2017가을', '운항_가을 총합', '운송량',
       '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12', '운송량_2017.1',
       '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2', '운송량_2016겨울',
       '운송량_2017겨울', '운송량_겨울 총합', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_봄총합', '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6',
       '운송량_2017.7', '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_여름 총합',
       '운송량_2016.9', '운송량_2016.10', '운송량_2016.11', '운송량_2017.9', '운송량_2017.10',
       '운송량_2017.11', '운송량_2016가을', '운송량_2017가을', '운송량_가을 총합'],
      dtype='object')

In [4]:
flight_route_info.filter(like='2016.6').head()

  2016.6  운항_2016.6  운송량_2016.6
0      O          4         692
1      O          4         692
2      O          4         596
3      O          0           0
4      O          5         985

In [5]:
flight_regex = flight_route_info.filter(regex='\d')

In [6]:
flight_regex.columns

Index(['2016.6', '2018.5', '운항_2016', '운항_2017', '운항_2018', '운항_2016.12',
       '운항_2017.1', '운항_2017.2', '운항_2017.12', '운항_2018.1', '운항_2018.2',
       '운항_2016겨울', '운항_2017겨울', '운항_2017.3', '운항_2017.4', '운항_2017.5',
       '운항_2018.3', '운항_2018.4', '운항_2018.5', '운항_2017봄', '운항_2018봄',
       '운항_2016.6', '운항_2016.7', '운항_2016.8', '운항_2017.6', '운항_2017.7',
       '운항_2017.8', '운항_2016여름', '운항_2017여름', '운항_2016.9', '운항_2016.10',
       '운항_2016.11', '운항_2017.9', '운항_2017.10', '운항_2017.11', '운항_2016가을',
       '운항_2017가을', '운송량_2016', '운송량_2017', '운송량_2018', '운송량_2016.12',
       '운송량_2017.1', '운송량_2017.2', '운송량_2017.12', '운송량_2018.1', '운송량_2018.2',
       '운송량_2016겨울', '운송량_2017겨울', '운송량_2017.3', '운송량_2017.4', '운송량_2017.5',
       '운송량_2018.3', '운송량_2018.4', '운송량_2018.5', '운송량_2017봄', '운송량_2018봄',
       '운송량_2016.6', '운송량_2016.7', '운송량_2016.8', '운송량_2017.6', '운송량_2017.7',
       '운송량_2017.8', '운송량_2016여름', '운송량_2017여름', '운송량_2016.9', '운송량_2016.10',
       '운송량_2016.11', '운송량_2017.9', '운송량_2017.10', '운송량_2017.11', '운송량_2016가을',
       '운송량_2017가을'],
      dtype='object')

In [7]:
flight_route_info.filter(like='2018').head()

,2018.5,운항_2018,운항_2018.1,운항_2018.2,운항_2018.3,운항_2018.4,운항_2018.5,운항_2018봄,운송량_2018,운송량_2018.1,운송량_2018.2,운송량_2018.3,운송량_2018.4,운송량_2018.5,운송량_2018봄
0,O,22,4,5,5,5,3,13,3578,596,820,970,745,447,2162
1,O,23,5,4,4,6,4,14,4102,895,896,746,969,596,2311
2,O,16,4,2,4,4,2,10,2459,596,298,596,596,373,1565
3,O,9,1,2,2,3,1,6,1341,149,298,298,447,149,894
4,O,9,1,2,2,2,2,6,1416,149,298,373,298,298,969

## 예제 3-10 결측값을 처리하기

In [8]:
import numpy as np

In [9]:
s = pd.Series([0, 1, np.nan, 3])

In [10]:
s.fillna(method='ffill')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [11]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [12]:
s.fillna(method='bfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [13]:
s.fillna(method='backfill')

0    0.0
1    1.0
2    3.0
3    3.0
dtype: float64

In [14]:
flight_route_info.isnull().sum().head(13)

노선명          0
항공사          0
출발지          0
출발국          0
도착지          0
도착국          0
검수           0
2016.6       0
2018.5       0
상태           0
비고         412
운항 횟수        0
운항_2016      0
dtype: int64

In [15]:
s.fillna(method='pad')

0    0.0
1    1.0
2    1.0
3    3.0
dtype: float64

In [16]:
flight_route_info.isnull().sum().sum()

412

In [17]:
flight_route_info['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.04.26. 이후 기록 없음      2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [18]:
flight_route_info['비고'].dtype

dtype('O')

In [19]:
flight_route_info.fillna(" ",axis=1, inplace=True)

In [20]:
flight_route_info.isnull().sum().sum()

0

In [21]:
flight_route_info['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2017.09.16 이후 폐선          2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [22]:
flight_route_info_2 = pd.read_csv('../data/flight_route_info.csv',encoding='cp949')

In [23]:
flight_route_info_2['비고'].value_counts(dropna=False).head()

NaN                     412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.04.26. 이후 기록 없음      2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

In [24]:
flight_route_info_3 = flight_route_info_2.select_dtypes(['object']).fillna('')

In [25]:
flight_route_info_3['비고'].value_counts(dropna=False).head()

                        412
2016.11.05. 이후 폐선         4
2018.04.24. 이후 기록 없음      3
2018.04.26. 이후 기록 없음      2
2017.03.24. 이후 폐선         2
Name: 비고, dtype: int64

## 예제 3-11 결측값을 보간처리하기

In [26]:
import numpy as np

In [27]:
s = pd.Series([0, 1, np.nan, 3])

In [28]:
s.interpolate()

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float64

In [29]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')

In [30]:
airplane_info.isnull().sum()

기체번호     0
항공사      0
기종       0
정원_F     0
정원_C     0
정원_W     0
정원_Y     0
총정원     71
dtype: int64

In [31]:
airplane_info[['기체번호','총정원']].tail()

        기체번호  총정원
2173  VP-BWW  NaN
2174  VP-BRM  NaN
2175  VP-BWZ  NaN
2176  VP-BWX  NaN
2177  VP-BRB  NaN

In [32]:
a = airplane_info['총정원'].interpolate()

In [33]:
a.isnull().sum()

0

In [34]:
a.tail()

2173    180.0
2174    180.0
2175    180.0
2176    180.0
2177    180.0
Name: 총정원, dtype: float64

## 예제 3-12 열 삭제

In [35]:
central_asia_flight_info = pd.read_csv('../data/central_asia_flight_info.csv',encoding='cp949')

In [36]:
central_asia_flight_info.head()

,노선명,출발 공항,출발 국가,도착 공항,도착 국가,기체번호,기종,정원(전체),년도,월,일,Unnamed: 11
0,7J105,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2016,6,5,NaN
1,7J105,DYU,TJK,IKA,IRI,EY-444,B737-3L9,149,2016,6,12,NaN
2,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,6,19,NaN
3,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,6,26,NaN
4,7J105,DYU,TJK,IKA,IRI,EY-757,B757-231,197,2016,7,3,NaN

In [37]:
central_asia_flight_info.count()

노선명            95015
출발 공항          95015
출발 국가          95015
도착 공항          95015
도착 국가          95015
기체번호           95015
기종             95015
정원(전체)         95015
년도             95015
월              95015
일              95015
Unnamed: 11        0
dtype: int64

In [38]:
central_asia_flight_info.isnull().sum()

노선명                0
출발 공항              0
출발 국가              0
도착 공항              0
도착 국가              0
기체번호               0
기종                 0
정원(전체)             0
년도                 0
월                  0
일                  0
Unnamed: 11    95015
dtype: int64

In [39]:
central = central_asia_flight_info.dropna(axis=1)

In [40]:
central.count()

노선명       95015
출발 공항     95015
출발 국가     95015
도착 공항     95015
도착 국가     95015
기체번호      95015
기종        95015
정원(전체)    95015
년도        95015
월         95015
일         95015
dtype: int64

In [41]:
central_drop = central_asia_flight_info.drop('Unnamed: 11', axis=1)

In [42]:
central_drop.count()

노선명       95015
출발 공항     95015
출발 국가     95015
도착 공항     95015
도착 국가     95015
기체번호      95015
기종        95015
정원(전체)    95015
년도        95015
월         95015
일         95015
dtype: int64

## 예제 3-13 행 삭제

In [43]:
airplane_info = pd.read_csv('../data/airplane_info.csv',encoding='cp949')

In [44]:
airplane_info.count()

기체번호    2178
항공사     2178
기종      2178
정원_F    2178
정원_C    2178
정원_W    2178
정원_Y    2178
총정원     2107
dtype: int64

In [45]:
import numpy as np

In [46]:
np.isnan(np.array([1,2,np.nan]))

array([False, False,  True])

In [47]:
airplane_info['총정원'].apply(np.isnan).tail()

2173    True
2174    True
2175    True
2176    True
2177    True
Name: 총정원, dtype: bool

In [48]:
airplane_info['총정원'].index

RangeIndex(start=0, stop=2178, step=1)

In [49]:
airplane_info['총정원'].index[[2107, 2108]]

Int64Index([2107, 2108], dtype='int64')

In [50]:
index_nan = airplane_info['총정원'].index[airplane_info['총정원'].apply(np.isnan)]

In [51]:
index_nan

Int64Index([2107, 2108, 2109, 2110, 2111, 2112, 2113, 2114, 2115, 2116, 2117,
            2118, 2119, 2120, 2121, 2122, 2123, 2124, 2125, 2126, 2127, 2128,
            2129, 2130, 2131, 2132, 2133, 2134, 2135, 2136, 2137, 2138, 2139,
            2140, 2141, 2142, 2143, 2144, 2145, 2146, 2147, 2148, 2149, 2150,
            2151, 2152, 2153, 2154, 2155, 2156, 2157, 2158, 2159, 2160, 2161,
            2162, 2163, 2164, 2165, 2166, 2167, 2168, 2169, 2170, 2171, 2172,
            2173, 2174, 2175, 2176, 2177],
           dtype='int64')

In [52]:
airplane_info_nan = airplane_info.drop(index=index_nan)

In [53]:
airplane_info_nan.shape

(2107, 8)

In [54]:
airplane_info_nan.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [55]:
airplane_info_dropna = airplane_info.dropna(axis=0)

In [56]:
airplane_info_dropna.shape

(2107, 8)

In [57]:
airplane_info_dropna.isnull().sum()

기체번호    0
항공사     0
기종      0
정원_F    0
정원_C    0
정원_W    0
정원_Y    0
총정원     0
dtype: int64

In [58]:
ai = airplane_info['총정원']

In [59]:
ai.isnull().sum()

71

In [60]:
ai_d = ai.dropna()

In [61]:
ai_d.isnull().sum()

0

## 예제 3-14 중복값 삭제

In [62]:
import seaborn as sns

In [63]:
iris = sns.load_dataset('iris')

In [64]:
iris.columns

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [65]:
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [66]:
iris.shape

(150, 5)

In [67]:
iris.duplicated().sum()

1

In [68]:
iris['species'].duplicated().head()

0    False
1     True
2     True
3     True
4     True
Name: species, dtype: bool

In [69]:
iris['species'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [70]:
iris['species'].drop_duplicates()

0          setosa
50     versicolor
100     virginica
Name: species, dtype: object

In [71]:
iris.shape

(150, 5)

In [72]:
iris_dup =  iris.copy()

In [73]:
iris.iloc[[0]]

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [74]:
iris_dup.iloc[1, : ] = iris.iloc[0, :]

In [75]:
iris_dup.head(5)

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [76]:
iris_dup.duplicated().sum()

2

In [77]:
iris_dup.drop_duplicates(inplace=True)

In [78]:
iris_dup.shape

(148, 5)

In [79]:
iris_dup.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
5           5.4          3.9           1.7          0.4  setosa

In [80]:
iris_dup.duplicated().sum()

0